package ru.spbstu.telematics.popov.lab05;

/**
 * Задание:
 * Автомобильное окно.Электрическое окно в автомобиле управляется двумя кнопками-переключателями: вверх и вниз.
 * Когда нажата кнопка вверх, окно начинает закрываться. Если кнопка вверх нажата меньше, чем Т секунд окно
 * закрывается полностью. Если кнопка вверх нажата больше, чем Т секунд, то когда кнопка будет отпущена,
 * окна остановит закрываться. Кнопка вниз работает точно также. Механическая блокировка препятствует нажатию
 * двух кнопок одновременно.Окно перемещается моторчиком, который отвечает на команды start_close, stop_close,
 * start_open и stop_open. Два датчика, закрыто и открыто, определяют соответственно, когда окно полностью закрыто
 * и когда оно полностью открыто. Окну требуется R единиц времени для перемещения из полностью открытой позиции до
 * полностью закрытой и наоборот.
 */
public class Lab05 {
    public static void main(String[] args) {

    }
}
